#language: ru
Функционал: Яндекс маркет


  Сценарий: Выбор телевизора

  Когда выбран пункт меню Маркет

  И выбран раздел Электроника

  И выбран раздел Телевизоры

  И Задан параметр поиска от N рублей

    И Выбран пункт Samsung
    И Выбран пункт LG
  Тогда Проверка числа элементов

  Когда Ввод в поисковую строку

# проверить, что наименование товара соответствует запомненному значению


  Сценарий: Выбор наушников

    Когда выбран пункт меню Маркет

    И выбран раздел Электроника

    И выбран раздел Наушники

   И Задан параметр поиска от N рублей

    И Выбран пункт Beats

    Тогда Проверка числа элементов

    Когда Ввод в поисковую строку